In [1]:
import pandas as pd
import numpy as np

In [2]:
x=np.array([[2,3,np.nan],[11,np.nan,3],[17,np.nan,np.nan]])

In [3]:
df = pd.DataFrame(x,index =["i1","i2","i3"],columns=["c1","c2","c3"])

In [4]:
df

      c1   c2   c3
i1   2.0  3.0  NaN
i2  11.0  NaN  3.0
i3  17.0  NaN  NaN

In [5]:
df.dropna()

Empty DataFrame
Columns: [c1, c2, c3]
Index: []

In [6]:
df.dropna(axis=1)

      c1
i1   2.0
i2  11.0
i3  17.0

In [7]:
df.dropna(thresh=2)   #threshold

      c1   c2   c3
i1   2.0  3.0  NaN
i2  11.0  NaN  3.0

In [8]:
df

      c1   c2   c3
i1   2.0  3.0  NaN
i2  11.0  NaN  3.0
i3  17.0  NaN  NaN

In [9]:
df.fillna(value=17)

      c1    c2    c3
i1   2.0   3.0  17.0
i2  11.0  17.0   3.0
i3  17.0  17.0  17.0

In [10]:
df

      c1   c2   c3
i1   2.0  3.0  NaN
i2  11.0  NaN  3.0
i3  17.0  NaN  NaN

In [11]:
df.sum()

c1    30.0
c2     3.0
c3     3.0
dtype: float64

In [12]:
df.sum().sum()

36.0

In [13]:
df.size

9

In [14]:
df.isnull()

       c1     c2     c3
i1  False  False   True
i2  False   True  False
i3  False   True   True

In [15]:
df.isnull().sum()

c1    0
c2    2
c3    2
dtype: int64

In [16]:
df.isnull().sum().sum()

4

In [17]:
def Meancal(df):
    totalsum =df.sum().sum()
    totalnum = df.size-df.isnull().sum().sum()
    return totalsum/totalnum

In [21]:
df.fillna(value=Meancal(df),inplace =True)

In [22]:
df

      c1   c2   c3
i1   2.0  3.0  7.2
i2  11.0  7.2  3.0
i3  17.0  7.2  7.2